import type { ColorDictionary } from '../types.ts';

export const fa: ColorDictionary = {
  locale: 'fa',
  source: 'uw+research',
  basic: {
    names: [
      'سیاه',
      'سفید',
      'قرمز',
      'سبز',
      'زرد',
      'آبی',
      'قهوه‌ای',
      'نارنجی',
      'صورتی',
      'بنفش',
      'خاکستری',
    ],
    colors: new Float32Array([
      // سیاه
      0, 0, 0,
      // سفید
      1, 0, 0,
      // قرمز
      0.627955, 0.224863, 0.125846,
      // سبز
      0.519752, -0.140302, 0.107676,
      // زرد
      0.967983, -0.071369, 0.19857,
      // آبی
      0.452014, -0.032457, -0.311528,
      // قهوه‌ای
      0.470784, 0.070809, 0.08696,
      // نارنجی
      0.792688, 0.056611, 0.161385,
      // صورتی
      0.867738, 0.07298, 0.009071,
      // بنفش
      0.420914, 0.164704, -0.101472,
      // خاکستری
      0.599871, 0, 0,
    ]),
  },
  extended: {
    names: [
      'فیروزه‌ای',
      'بژ',
      'آبی آسمانی',
      'سبز تیره',
      'آبی تیره',
      'زرشکی',
      'طلایی',
      'نقره‌ای',
      'بادمجانی',
      'یاسی',
    ],
    colors: new Float32Array([
      // فیروزه‌ای
      0.822334, -0.130229, -0.011597,
      // بژ
      0.963574, -0.009585, 0.031352,
      // آبی آسمانی
      0.814817, -0.057156, -0.05868,
      // سبز تیره
      0.436018, -0.117699, 0.090329,
      // آبی تیره
      0.287824, -0.020667, -0.198369,
      // زرشکی
      0.379975, 0.144353, 0.048642,
      // طلایی
      0.886771, -0.016925, 0.181398,
      // نقره‌ای
      0.807796, 0, 0,
      // بادمجانی
      0.414942, 0.050991, -0.011421,
      // یاسی
      0.758557, 0.056642, -0.037885,
    ]),
  },
};
