import type { ColorDictionary } from '../types.ts';

// Georgian (ქართული) — 111 survey responses
export const ka: ColorDictionary = {
  locale: 'ka',
  source: 'uwdata-multilingual-colors',
  basic: {
    names: [
      'ლურჯი',
      'ცისფერი',
      'მწვანე',
      'ყვითელი',
      'ნარინჯისფერი',
      'ვარდისფერი',
      'წითელი',
      'იისფერი',
      'მაჯენტა',
      'იასამნისფერი',
      'ზურმუხტისფერი',
    ],
    colors: new Float32Array([
      0.530429, -0.031506, -0.259382,
      0.803271, -0.116475, -0.080698,
      0.87262, -0.221313, 0.176478,
      0.93718, -0.076016, 0.192324,
      0.733405, 0.1104, 0.148684,
      0.660459, 0.271459, -0.052148,
      0.630386, 0.229785, 0.110395,
      0.597219, 0.200927, -0.220529,
      0.660459, 0.271459, -0.052148,
      0.631172, 0.24093, -0.171701,
      0.88182, -0.188683, 0.071164,
    ]),
  },
  extended: {
    names: [
      'სტაფილოსფერი',
      'ლაჟვარდოვანი',
    ],
    colors: new Float32Array([
      0.806975, 0.044585, 0.164434,
      0.889283, -0.173708, 0.031402,
    ]),
  },
};
