import type { ColorDictionary } from '../types.ts';

// Sinhala (සිංහල) — 48 survey responses
export const si: ColorDictionary = {
  locale: 'si',
  source: 'uwdata-multilingual-colors',
  basic: {
    names: [
      'නිල්',
      'රෝස',
      'කහ',
      'කොළ',
      'තැඹිලි',
      'රතු',
      'දම්',
      'rosa',
      'kola',
      'thambili',
      'la  kola',
    ],
    colors: new Float32Array([
      0.64096, -0.057134, -0.188555,
      0.655358, 0.269401, -0.061375,
      0.921762, -0.120072, 0.189633,
      0.87522, -0.205009, 0.112017,
      0.775346, 0.071676, 0.157677,
      0.631169, 0.226118, 0.116098,
      0.569693, 0.167565, -0.245142,
      0.640361, 0.253622, 0.037345,
      0.869114, -0.223935, 0.156829,
      0.643194, 0.206596, 0.129171,
      0.872448, -0.213045, 0.131341,
    ]),
  },
  extended: {
    names: [
      'thada kola',
      'thada nil',
      'thada rosa',
      'kaha',
      'la nil',
      'kola nil',
      'dam rosa',
      'dam',
    ],
    colors: new Float32Array([
      0.874645, -0.206609, 0.115902,
      0.552393, -0.036337, -0.244913,
      0.642091, 0.256084, 0.027881,
      0.865209, -0.001178, 0.176824,
      0.682396, -0.070632, -0.163168,
      0.888537, -0.175073, 0.035133,
      0.665428, 0.273428, -0.069547,
      0.523936, 0.109582, -0.271662,
    ]),
  },
};
