import type { ColorDictionary } from '../types.ts';

// Telugu (తెలుగు) — 70 survey responses
export const te: ColorDictionary = {
  locale: 'te',
  source: 'uwdata-multilingual-colors',
  basic: {
    names: [
      'నీలం',
      'పచ్చ',
      'నారింజ',
      'గులాబీ',
      'చిలకపచ్చ',
      'గులాబి',
      'పసుప్పచ్చ',
      'ఊదా',
      'ఎర్ర',
      'పసుపుపచ్చ',
      'ఎరుపు',
    ],
    colors: new Float32Array([
      0.656318, -0.063281, -0.17387,
      0.872584, -0.214718, 0.143029,
      0.725939, 0.117659, 0.147078,
      0.662076, 0.272173, -0.057955,
      0.880922, -0.206441, 0.179527,
      0.662486, 0.272342, -0.059406,
      0.886771, -0.016925, 0.181398,
      0.60793, 0.205478, -0.222888,
      0.632153, 0.237533, 0.090464,
      0.916768, -0.037881, 0.18775,
      0.630474, 0.232967, 0.103694,
    ]),
  },
  extended: {
    names: [
      'ఆకుపచ్చ',
      'ఉదా',
      'చిలుక పచ్చ',
    ],
    colors: new Float32Array([
      0.880067, -0.19269, 0.081408,
      0.55848, 0.154842, -0.251667,
      0.926212, -0.13167, 0.190664,
    ]),
  },
};
